{
    "intents": [
        {
            "tag": "ស្វាគមន៍",
            "patterns": [
                "សួស្ដី",
                "សួស្ដីបង",
                "ហាយ",
                "ហែលឡូ",
                "ជម្រាបសួរ",
                "ហាាយ",
                "អរុណសួស្ដី"
            ],
            "responses": [
                "បាទ ជម្រាបសួរបង តើបងត្រូវការអ្វីដែរ?",
                "បាទបង តើមានអ្វីឲ្យខាងប្អូនជួយដែរ?",
                "តើប្អូនអាចជួយអ្វីបងបានខ្លះដែរ?",
                "សូមស្វាគមន៍បង តើបងមានអ្វីឲ្យប្អូនបំរើដែរឬទេ?",
                "បាទបង តើមានអ្វីដែរទេបង ដែលប្អូនអាចជួយបាន?",
                "តើបងចង់បានអ្វីដែរ?"
            ]
        },
        {
            "tag": "ការកម្ម៉ង់",
            "patterns": [
                "តើកន្លែងបងមានប្រភេទកាហ្វេអ្វីខ្លះ?",
                "តើកន្លែងបងមានប្រភេទ Coffee អ្វីខ្លះ",
                "តើបងអាចឲ្យខ្ញុំមើលមីនុយសិនបានអត់?",
                "តើបងអាចឲ្យខ្ញុំមើល Menu សិនបានអត់",
                "មានកាហ្វេអ្វីខ្លះ",
                "មានកាហ្វេប៉ុន្មានប្រភេទ"
            ],
            "responses": [
                "ខ្ញុំមាន Espresso, Americano, Latte, Cappuccino, Mocha Macchiato, Flat White, Affogato, Nitro, Cold Brew",
                "ពួកយើងមានកាហ្វេ Espresso, Americano, Latte, Cappuccino, Mocha Macchiato, Flat White, Affogato, Nitro, Cold Brew",
                "ខាងខ្ញុំមាន Espresso, Americano, Latte, Cappuccino, Mocha Macchiato, Flat White, Affogato, Nitro​ និង Cold Brew តើបងមានត្រូវការអ្វីទៀតទេ?"
            ]
        },
        {
            "tag": "ការស្នាក់នៅ",
            "patterns": [
                "តើមានបន្ទប់ទំនេរដែរទេ?",
                "បាទបង តើមានបន្ទប់ទំនេរទេ?",
                "តើខ្ញុំអាចកក់បន្ទប់បានទេ?",
                "តើបងមានបន្ទប់ទំនេរដែរទេ?",
                "ខ្ញុំចង់កក់បន្ទប់"
            ],
            "responses": [
                "បាទបង យើងមានបន្ទប់ទំនេរ សូមមើលមីនុយនៅខាងមុខ",
                "បាទបង មានបន្ទប់ទំនេរ តើបងចង់កក់បន្ទប់ប្រភេទអ្វី?",
                "យើងមានបន្ទប់ Standard, Deluxe, Suite តើបងចង់ត្រួតពិនិត្យទេ?"
            ]
        },
        {
            "tag": "ម៉ោងបើក",
            "patterns": [
                "តើបើកម៉ោងប៉ុន្មាន?",
                "ម៉ោងបើកដំណើរការអ្វីខ្លះ?",
                "តើកន្លែងនេះបើកម៉ោងណា?",
                "តើខ្ញុំអាចមកនៅម៉ោងណា?",
                "ម៉ោងបើកប៉ុន្មាន?"
            ],
            "responses": [
                "យើងបើកពីម៉ោង 7 ព្រឹក ដល់ 10 យប់",
                "ម៉ោងបើកបើកដំណើរការគឺ 7am ដល់ 10pm",
                "សូមមកចាប់ពីម៉ោង 7 ព្រឹក ដល់ 10 យប់"
            ]
        },
        {
            "tag": "សេវាកម្ម",
            "patterns": [
                "តើបងមានសេវាកម្មអ្វីខ្លះ?",
                "សេវាកម្មមានអ្វីខ្លះ?",
                "ខ្ញុំអាចទទួលបានសេវាកម្មអ្វីខ្លះ?",
                "បងមានសេវាកម្មអ្វីខ្លះ?",
                "តើសេវាកម្មអ្វីខ្លះនៅទីនេះ?"
            ],
            "responses": [
                "យើងមានសេវាកម្មអ៊ីនធឺណេត Wifi, បន្ទប់ប្រជុំនិងបន្ទប់ទឹករ",
                "ខាងយើងមានសេវាកម្មជួលម៉ូតូ, រថយន្ត, និងទេសចរណ៍",
                "សូមមើលមីនុយសេវាកម្មទាំងអស់នៅខាងមុខ"
            ]
        },
        {
            "tag": "តម្លៃ",
            "patterns": [
                "តម្លៃប៉ុន្មាន?",
                "តម្លៃបន្ទប់ប៉ុន្មាន?",
                "តើខ្ញុំអាចដឹងតម្លៃទំនិញបានទេ?",
                "តម្លៃប្រភេទអ្វី?",
                "តើតម្លៃប៉ុន្មាន?"
            ],
            "responses": [
                "តម្លៃបន្ទប់របស់យើងចាប់ពី $50 ដល់ $200",
                "តម្លៃទំនិញសូមមើលមីនុយនៅខាងមុខ",
                "តម្លៃអ្វីខ្លះអាចអានបាននៅក្នុងមីនុយ"
            ]
        },
        {
            "tag": "ការកក់",
            "patterns": [
                "តើខ្ញុំអាចកក់បន្ទប់បានទេ?",
                "ខ្ញុំចង់កក់បន្ទប់",
                "តើបងអាចជួយកក់បន្ទប់បានទេ?",
                "តើខ្ញុំអាចកក់ទំនិញនេះបានទេ?",
                "ខ្ញុំចង់កក់"
            ],
            "responses": [
                "បាទបង អាចកក់តាមទូរសព្ទលេខ 012345678",
                "អាចកក់តាមបណ្ដាញ online របស់យើង",
                "តើបងចង់កក់បន្ទប់ប្រភេទអ្វី?"
            ]
        },
        {
            "tag": "ទីតាំង",
            "patterns": [
                "តើកន្លែងនេះនៅណា?",
                "តើខ្ញុំអាចរកទីតាំងបានយ៉ាងដូចម្តេច?",
                "ទីតាំងកន្លែងនេះនៅណា?",
                "តើខ្ញុំអាចដឹងទីតាំងបានទេ?",
                "សូមប្រាប់ខ្ញុំអំពីទីតាំង"
            ],
            "responses": [
                "យើងនៅលើផ្លូវ 271 កែងផ្លូវ 101",
                "អាស័យដ្ឋានរបស់យើងនៅលើផ្លូវព្រះសីហនុ",
                "តាមផ្លូវទៅស្តាតអូឡាំពិច"
            ]
        },
        {
            "tag": "ការទូទាត់",
            "patterns": [
                "តើខ្ញុំអាចទូទាត់បានយ៉ាងដូចម្តេច?",
                "ការទូទាត់ធ្វើដូចម្តេច?",
                "តើខ្ញុំអាចបង់ប្រាក់បានតាមរបៀបណា?",
                "តើបង់ប្រាក់ធ្វើយ៉ាងដូចម្តេច?",
                "សូមប្រាប់អំពីការទូទាត់"
            ],
            "responses": [
                "អាចទូទាត់តាមរយៈ Visa, MasterCard, PayPal ឬជា Hotspot",
                "យើងទទួលទូទាត់តាមរយៈកាតឥណទាន និងឥណពន្ធ",
                "បង់ប្រាក់តាមរយៈកាតធនាគារ ឬសាច់ប្រាក់"
            ]
        },
        {
            "tag": "សំណូមពរ",
            "patterns": [
                "ខ្ញុំមានសំណូមពរ",
                "សូមជួយខ្ញុំ",
                "ខ្ញុំចង់ស្នើសុំអ្វីមួយ",
                "តើខ្ញុំអាចស្នើសុំបានទេ?",
                "ខ្ញុំមានបញ្ហា"
            ],
            "responses": [
                "តើបងមានអ្វីសំណូមពរទេ?",
                "សូមប្រាប់ខ្ញុំអំពីបញ្ហារបស់បង",
                "ខ្ញុំនឹងជួយបងអ្វីដែលខ្ញុំអាចធ្វើបាន"
            ]
        }
    ]
}
